app/controllers/admin_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def pag_admin
    @usuarios=Usuario.all

INSERT INTO "usuarios" ("nombre", "importe", "concepto", "procesador", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "asdfa"], ["importe", 1111.0], ["concepto", "asdf"], ["procesador", "asdf"], ["created_at", "2016-04-10 11:19:39.399672"], ["updated_at", "2016-04-10 11:19:39.399672"]]
SELECT "usuarios".* FROM "usuarios"
---
  def nuevo
    nombre=params[:nombre]
    importe=params[:importe].to_d
    concepto=params[:concepto]
    procesador=params[:procesador]

    usuariosHash={}
    usuariosHash[:nombre]=nombre
    usuariosHash[:importe]=importe
    usuariosHash[:concepto]=concepto
    usuariosHash[:procesador]=procesador

    Usuario.create(usuariosHash)
    @usuarios=Usuario.all

DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 1]]
SELECT "usuarios".* FROM "usuarios"
---
  def borrar
    id=params[:id].to_i

    Usuario.delete id
    @usuarios=Usuario.all

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 0]]
---
  def modificar_vista
    id=params[:id].to_i
    @usuario=Usuario.find id

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", 58]]
UPDATE "usuarios" SET "nombre" = ?, "importe" = ?, "concepto" = ?, "procesador" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["nombre", "Nuria"], ["importe", 100.0], ["concepto", "clicks"], ["procesador", "yo"], ["updated_at", "2016-04-10 12:45:32.222603"], ["id", 57]]
---
  def modificar
    id=params[:id].to_i
    nombreNuevo=params[:nombre]
    importeNuevo=params[:importe].to_i
    conceptoNuevo=params[:concepto]
    procesadorNuevo=params[:procesador]

    usuariosHash={}
    usuariosHash[:nombre]=nombreNuevo
    usuariosHash[:importe]=importeNuevo
    usuariosHash[:concepto]=conceptoNuevo
    usuariosHash[:procesador]=procesadorNuevo

    usuarioABuscar=Usuario.find id
    usuarioABuscar.update_attributes(usuariosHash)

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."nombre" = 'Usuario'
---
  def buscar_por_nombre
    nombre=params[:nombre]
    importe=params[:importe]

    @usuariosEncontrados=Usuario.where(:nombre=>nombre)